# DataFrame Attributes

üëâüèª Every dataframe has attributes. These are not optional.

In [ ]:
`Attribute`: Meaning you can say DF columns will return this kind of index object essentially just a list of column names.
This is going to be especially useful when you're trying to index a column and maybe the spacing is weird or you can't quite figure out what the string is.

Object.method()
Object.attribute

‚ö†Ô∏è Do not use parentheses for attributes.

*df.loc
*df.iloc
*df.ix
*df.shape
*df.index
*df.column

üëâüèª These are dataframe methods for `selecting rows and columns`.

In [1]:
import pandas as pd

In [2]:
ufo = pd.read_csv("http://bit.ly/uforeports")

In [3]:
ufo.head(3)

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke             NaN           OVAL    CO  2/15/1931 14:00

## `loc` method

`loc` selects the columns and rows `by label`.

label means for `rows`-->`index`, for `columns`--->`column name`

format: [] notation is used. [`rows` `,` `columns`]

### single row

In [4]:
ufo.loc[0, :] # : means all columns, this bring us pandas series. Sonu√ß: demekki satƒ±rlar da s√ºtunlar gibi seridir.

City                       Ithaca
Colors Reported               NaN
Shape Reported           TRIANGLE
State                          NY
Time               6/1/1930 22:00
Name: 0, dtype: object

### multiple rows

In [6]:
ufo.loc[[1,2,3], :]# for multiple rows you can pass list

          City Colors Reported Shape Reported State             Time
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3      Abilene             NaN           DISK    KS   6/1/1931 13:00

In [7]:
ufo.loc[0:2, :]# row define by 0 through 2,

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke             NaN           OVAL    CO  2/15/1931 14:00

‚ö†Ô∏è `loc[0:2]` `brings all 0,1 and 2 nd rows`, `unlike` `range` which finishes one behind.

In [ ]:
üëâüèª loc is inclusive in both sides

### column selection

In [12]:
ufo.loc[:, "City"].head()

0                  Ithaca
1             Willingboro
2                 Holyoke
3                 Abilene
4    New York Worlds Fair
Name: City, dtype: object

In [13]:
ufo.loc[:, ["City", "State"]].head()

                   City State
0                Ithaca    NY
1           Willingboro    NJ
2               Holyoke    CO
3               Abilene    KS
4  New York Worlds Fair    NY

In [15]:
ufo.loc[:, "City": "State"].head()

                   City Colors Reported Shape Reported State
0                Ithaca             NaN       TRIANGLE    NY
1           Willingboro             NaN          OTHER    NJ
2               Holyoke             NaN           OVAL    CO
3               Abilene             NaN           DISK    KS
4  New York Worlds Fair             NaN          LIGHT    NY

### rows&columns combination

In [18]:
ufo.loc[0:2, "City": "State"].head()

          City Colors Reported Shape Reported State
0       Ithaca             NaN       TRIANGLE    NY
1  Willingboro             NaN          OTHER    NJ
2      Holyoke             NaN           OVAL    CO

In [20]:
ufo.head(3).drop("Time", axis=1)

          City Colors Reported Shape Reported State
0       Ithaca             NaN       TRIANGLE    NY
1  Willingboro             NaN          OTHER    NJ
2      Holyoke             NaN           OVAL    CO

### Using loc with conditionals

In [24]:
ufo[ufo.City=="Oakland"].head(2)# this is without loc

         City Colors Reported Shape Reported State             Time
1694  Oakland             NaN          CIGAR    CA  7/21/1968 14:00
2144  Oakland             NaN           DISK    CA   8/19/1971 0:00

In [27]:
ufo.loc[ufo.City=="Oakland", :].head(2)# the same result but more explicit

         City Colors Reported Shape Reported State             Time
1694  Oakland             NaN          CIGAR    CA  7/21/1968 14:00
2144  Oakland             NaN           DISK    CA   8/19/1971 0:00

In [28]:
ufo.loc[ufo.City=="Oakland", "State"].head(2)# flexible because you can choose columns, this will not cause problems

1694    CA
2144    CA
Name: State, dtype: object

In [30]:
ufo[ufo.City=="Oakland"].State.head(2)# aynƒ± sonu√ß ama bu chain indexing, causes problems under certain scenarios

1694    CA
2144    CA
Name: State, dtype: object

## `iloc` method

iloc is for filtering rows and selecting columns by integer position.

i stands for integer.

**iloc** Type:property, Purely integer-location based indexing for selection by position.

the same logic, what rows do i want, what columns do i want.

In [32]:
ufo.iloc[:, [0,3]].head()

                   City State
0                Ithaca    NY
1           Willingboro    NJ
2               Holyoke    CO
3               Abilene    KS
4  New York Worlds Fair    NY

‚ö†Ô∏è for iloc it is exclusive of 2nd number.

In [33]:
ufo.iloc[0:3, :]

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke             NaN           OVAL    CO  2/15/1931 14:00

loc for labels, range: inclusive in both sides
iloc for integer position, range: exclusive of 2nd number

### selecting columns

In [ ]:
inner bracket: ["City", "State"]: list 
outer bracket: you wanna select columns

In [38]:
ufo[["City", "State"]].head()

                   City State
0                Ithaca    NY
1           Willingboro    NJ
2               Holyoke    CO
3               Abilene    KS
4  New York Worlds Fair    NY

In [40]:
ufo.loc[:, ["City", "State"]].head()# this code is more explicit

                   City State
0                Ithaca    NY
1           Willingboro    NJ
2               Holyoke    CO
3               Abilene    KS
4  New York Worlds Fair    NY

In [42]:
ufo[0:2]# it refers to rows but difficult to remember, logic is not clear, stay away from it.

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00

In [43]:
ufo.iloc[0:2, :]# much more better, you know the logic

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00

## `ix` method

It allows us to `mix` `labels and integers`.

In [46]:
drinks = pd.read_csv("http://bit.ly/drinksbycountry", index_col="country")
drinks.head()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
country,,,,,
Afghanistan,0,0,0,0.0,Asia
Albania,89,132,54,4.9,Europe
Algeria,25,0,14,0.7,Africa
Andorra,245,138,312,12.4,Europe
Angola,217,57,45,5.9,Africa

In [47]:
drinks.ix["Albania", 0]# depreceted

AttributeError: 'DataFrame' object has no attribute 'ix'

In [3]:
mydict = [{'a': 1, 'b': 2, 'c': 3, 'd': 4},
            {'a': 100, 'b': 200, 'c': 300, 'd': 400},
            {'a': 1000, 'b': 2000, 'c': 3000, 'd': 4000 }]

In [4]:
mydict

[{'a': 1, 'b': 2, 'c': 3, 'd': 4},
 {'a': 100, 'b': 200, 'c': 300, 'd': 400},
 {'a': 1000, 'b': 2000, 'c': 3000, 'd': 4000}]

In [5]:
df = pd.DataFrame(mydict)

In [6]:
df

      a     b     c     d
0     1     2     3     4
1   100   200   300   400
2  1000  2000  3000  4000

**Indexing just the rows**

With a scalar integer.

In [9]:
df.iloc

In [10]:
df.iloc[0]

a    1
b    2
c    3
d    4
Name: 0, dtype: int64

In [11]:
type(df.iloc[0])

pandas.core.series.Series

With a list of integers.

In [12]:
df.iloc[[0]]

   a  b  c  d
0  1  2  3  4

In [13]:
df.iloc[[0,1]]

     a    b    c    d
0    1    2    3    4
1  100  200  300  400

With a `slice` object.

In [15]:
df.iloc[2:3]

      a     b     c     d
2  1000  2000  3000  4000

With a boolean mask the same length as the index.

In [16]:
df.iloc[[True, False, True]]

      a     b     c     d
0     1     2     3     4
2  1000  2000  3000  4000

With a callable, useful in method chains. The `x` passed
to the ``lambda`` is the DataFrame being sliced. This selects
the rows whose index label even.

In [17]:
df.iloc[lambda x: x.index %2 ==0]

      a     b     c     d
0     1     2     3     4
2  1000  2000  3000  4000

**Indexing both axes**

You can mix the indexer types for the index and columns. Use ``:`` to
select the entire axis.

With scalar integers.

In [22]:
df

      a     b     c     d
0     1     2     3     4
1   100   200   300   400
2  1000  2000  3000  4000

In [23]:
df.iloc[0]

a    1
b    2
c    3
d    4
Name: 0, dtype: int64

In [25]:
df.iloc[1:]

      a     b     c     d
1   100   200   300   400
2  1000  2000  3000  4000

In [18]:
df.iloc[0,1]

2

In [26]:
df.iloc[2,3]

4000

In [33]:
df.iloc[0,2]

3

In [34]:
df.iloc[1,3]

400

With lists of integers.

In [19]:
df.iloc[[0, 2], [1, 3]]

      b     d
0     2     4
2  2000  4000

In [31]:
df

      a     b     c     d
0     1     2     3     4
1   100   200   300   400
2  1000  2000  3000  4000

In [39]:
df.iloc[[0,2], [1,3]]

      b     d
0     2     4
2  2000  4000

With `slice` objects.

In [20]:
df.iloc[1:3, 0:3]

      a     b     c
1   100   200   300
2  1000  2000  3000

In [ ]:
‚Ä¢ iloc: index position
Type:        property
String form: <property object at 0x000002131A4B91D8>
Docstring:  Purely integer-location based indexing for selection by position.
			
			df.iloc[2]
			Same result with loc

## `index` attribute

`Docstring`: Immutable Index implementing a monotonic integer range.

`Type`: RangeIndex

üëâüèª Index are called `row labels`. This attribute gives the names of the rows.

In [55]:
drinks = pd.read_csv("http://bit.ly/drinksbycountry")
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [57]:
drinks.index.name

### Getting index of Pandas DataFrame

In [58]:
drinks.index

RangeIndex(start=0, stop=193, step=1)

In [68]:
for i in drinks.index:
    if i<2:
        print(i)

0
1

üëâ Neither the index or the columns are considered part of the dataframe contents.

In [33]:
drinks.shape # number of columns are 6. not includes index.

(193, 6)

üëâ Default index and headers are like this: 1,2,3,..

In [34]:
pd.read_table("http://bit.ly/movieusers", header= None, sep="|").head()

   0   1  2           3      4
0  1  24  M  technician  85711
1  2  53  F       other  94043
2  3  23  M      writer  32067
3  4  24  M  technician  43537
4  5  33  F       other  15213

### Why Indexes exists

3 Main reasons:
1. Identification
2. Selection
3. Alignment

### 1. Identification

Every row has a unique index. Even df is filtered, index number is not changed.

In [11]:
drinks[drinks.continent=="South America"].head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
6,Argentina,193,25,221,8.3,South America
20,Bolivia,167,41,8,3.8,South America
23,Brazil,245,145,16,7.2,South America
35,Chile,130,124,172,7.6,South America
37,Colombia,159,76,3,4.2,South America

### 2. Selection

üëâ If you know the index number you can select a row with loc method.

In [12]:
drinks.loc[23, "beer_servings"]

245

üëâ Burda yine index numarasƒ±nƒ± bilmek zorundasƒ±n. √áok da yardƒ±mcƒ± olmadƒ±.

üëâ Then you `change the index` with making the column of interest as a new index, than `use the loc method`.

In [59]:
drinks.set_index("country", inplace=True)

In [60]:
drinks.index

Index(['Afghanistan', 'Albania', 'Algeria', 'Andorra', 'Angola',
       'Antigua & Barbuda', 'Argentina', 'Armenia', 'Australia', 'Austria',
       ...
       'Tanzania', 'USA', 'Uruguay', 'Uzbekistan', 'Vanuatu', 'Venezuela',
       'Vietnam', 'Yemen', 'Zambia', 'Zimbabwe'],
      dtype='object', name='country', length=193)

In [42]:
drinks.columns# country columndan gitti

Index(['beer_servings', 'spirit_servings', 'wine_servings',
       'total_litres_of_pure_alcohol', 'continent'],
      dtype='object')

In [43]:
drinks.shape#s√ºtun sayƒ±sƒ± 5'e d√º≈üt√º.

(193, 5)

In [18]:
drinks.loc["Brazil", "beer_servings"]

245

### index `name property`

drinks.index.name = None
drinks.head()

Before resetting give the original name of index. Because pd decided what to call this column based upon the name of the index.

In [61]:
drinks.index.name

'country'

In [62]:
drinks.reset_index(inplace=True)

In [63]:
drinks.index.name

## `columns` attribute

`Docstring`: Immutable ndarray implementing an ordered, sliceable set. The basic object storing axis labels for all pandas objects.

`Type`: Index

This attribute return `index object` essentially just a list of column names.

In [30]:
drinks.columns

Index(['country', 'beer_servings', 'spirit_servings', 'wine_servings',
       'total_litres_of_pure_alcohol', 'continent'],
      dtype='object')

Useful when you're trying to index a column and maybe the spacing is weird or you can't quite figure out what the string is.

In [7]:
drinks.columns# bunun √ßƒ±ktƒ±sƒ± Index farklƒ±: that is the type of object. It is not referred to as the index though.

Index(['country', 'beer_servings', 'spirit_servings', 'wine_servings',
       'total_litres_of_pure_alcohol', 'continent'],
      dtype='object')

## `shape` attribute

DataFrame.shape is an attribute (remember: do not use parentheses for attributes) of a pandas Series and DataFrame containing the number of rows and columns: (nrows, ncolumns).

In [ ]:
A pandas Series is 1-dimensional and only the number of rows is returned.

In [29]:
titanic["Age"].shape

NameError: name 'titanic' is not defined